app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comments = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "first blog in ruby on rails"], ["post_id", 1], ["created_at", "2020-07-06 13:36:00.937389"], ["updated_at", "2020-07-06 13:36:00.937389"]]